astb_relise/src/DataProcessors/ДанныеПоЗанятамРабочимМестам/ДанныеПоЗанятамРабочимМестам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ДанныеПоЗанятамРабочимМестам</name>
</mdclass:DataProcessor>

astb_relise/src/Catalogs/Подразделения/Подразделения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Подразделения</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыДеятельности</name>
    <attributes>
      <name>ВидДеятельности</name>
      <type>
        <types>CatalogRef.ВидыЭкономическойДеятельности</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

astb_relise/src/DataProcessors/ДанныеПоЗанятамРабочимМестам/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Сотрудник_Подразделение_Должность <> Неопределено Тогда
		
		Если ТипЗнч(Параметры.Сотрудник_Подразделение_Должность) = Тип("СправочникСсылка.Сотрудники") Тогда
		
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.ЗанятыеРабочиеМеста,"Сотрудник",Параметры.Сотрудник_Подразделение_Должность,Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.ЗанятыеРабочиеМеста,"Подразделение",Справочники.Подразделения.ПустаяСсылка(),Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.ЗанятыеРабочиеМеста,"Должность",Справочники.ДолжностиИПрофессии.ПустаяСсылка(),Истина);
			
			ЭтаФорма.АвтоЗаголовок = Ложь;
			ЭтаФорма.Заголовок = "Данные по сотруднику (занятые рабочие места)";
			
			Элементы.ЗанятыеРабочиеМеста.ПодчиненныеЭлементы.ЗанятыеРабочиеМестаСотрудник.Видимость = Ложь;
			Элементы.ЗанятыеРабочиеМеста.ПодчиненныеЭлементы.ЗанятыеРабочиеМестаСотрудникТабельныйНомер.Видимость = Ложь;
			
		ИначеЕсли ТипЗнч(Параметры.Сотрудник_Подразделение_Должность) = Тип("СправочникСсылка.Подразделения") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.ЗанятыеРабочиеМеста,"Сотрудник",Справочники.Сотрудники.ПустаяСсылка(),Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.ЗанятыеРабочиеМеста,"Подразделение",Параметры.Сотрудник_Подразделение_Должность,Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.ЗанятыеРабочиеМеста,"Должность",Справочники.ДолжностиИПрофессии.ПустаяСсылка(),Истина);
			
			ЭтаФорма.АвтоЗаголовок = Ложь;
			ЭтаФорма.Заголовок = "Данные по подразделению (занятые рабочие места)";
			
			Элементы.ЗанятыеРабочиеМеста.ПодчиненныеЭлементы.ЗанятыеРабочиеМестаПодразделение.Видимость = Ложь;
			Элементы.ЗанятыеРабочиеМеста.ПодчиненныеЭлементы.ЗанятыеРабочиеМестаПодразделениеКодСинхронизации.Видимость = Ложь;
			
		ИначеЕсли ТипЗнч(Параметры.Сотрудник_Подразделение_Должность) = Тип("СправочникСсылка.ДолжностиИПрофессии") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.ЗанятыеРабочиеМеста,"Сотрудник",Справочники.Сотрудники.ПустаяСсылка(),Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.ЗанятыеРабочиеМеста,"Подразделение",Справочники.Подразделения.ПустаяСсылка(),Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.ЗанятыеРабочиеМеста,"Должность",Параметры.Сотрудник_Подразделение_Должность,Истина);
			
			ЭтаФорма.АвтоЗаголовок = Ложь;
			ЭтаФорма.Заголовок = "Данные по должности (занятые рабочие места)";	
			
			Элементы.ЗанятыеРабочиеМеста.ПодчиненныеЭлементы.ЗанятыеРабочиеМестаДолжность.Видимость = Ложь;
			Элементы.ЗанятыеРабочиеМеста.ПодчиненныеЭлементы.ЗанятыеРабочиеМестаДолжностьКод.Видимость = Ложь;
			
		Иначе
			
			Отказ = Истина;
			
		КонецЕсли;
		
	Иначе
		
		Отказ = Истина;
		
	КонецЕсли;

КонецПроцедуры
